app/views/stories/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."story_id" = ?  ORDER BY created_at DESC  [["story_id", 12]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."story_id" = ?  [["story_id", 1]]
---
			<div class="average-review-rating" data-score=<%= @average_review %>></div>
			<span class="number-of-reviews">Based on <%= @story.reviews.count %> reviews</span>