app/controllers/chats_controller.rb

	def create
		@chat = Chat.new(chat_params)
		@chat.story_id = @story.id
		@chat.user_id = current_user.id

		if @chat.save
---
INSERT INTO "chats" ("comment", "story_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "ok"], ["story_id", 9], ["user_id", 1], ["created_at", "2017-02-18 19:58:55.474412"], ["updated_at", "2017-02-18 19:58:55.474412"]]

	def destroy
		@chat.destroy
---
DELETE FROM "chats" WHERE "chats"."id" = ?  [["id", 1]]

		def find_story
			@story = Story.find(params[:story_id])
---
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", 9]]

		def find_chat
			@chat = Chat.find(params[:id])
---
SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", 1]]