app/controllers/reviews_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? AND "reviews"."story_id" = ?  ORDER BY "reviews"."id" ASC LIMIT 1  [["user_id", 1], ["story_id", 9]]
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", 2]]
---
	def new
		@review = Review.new
	if current_user
		@review = Review.where(user_id: current_user.id, story_id: params[:story_id]).first_or_initialize
    if @review.id.present?

INSERT INTO "reviews" ("rating", "comment", "story_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 4], ["comment", "Great Game"], ["story_id", 3], ["user_id", 1], ["created_at", "2017-02-11 02:01:56.141848"], ["updated_at", "2017-02-11 02:01:56.141848"]]
---
	def create
		@review = Review.new(review_params)
		@review.story_id = @story.id
		@review.user_id = current_user.id

		if @review.save

UPDATE "reviews" SET "rating" = ?, "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 3], ["comment", "Great Article, but has errors"], ["updated_at", "2017-02-19 01:57:56.058403"], ["id", 20]]
---
	def update
		if @review.update(review_params)

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", 9]]
---
		def find_story
			@story = Story.find(params[:story_id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 20]]
---
		def find_review
			@review = Review.find(params[:id])