app/controllers/stories_controller.rb

	def index
		if params[:category].blank?
			@stories = Story.all.order("created_at DESC")
		else
			@category_id = Category.find_by(name: params[:category]).id
			@stories = Story.where(:category_id => @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "stories".* FROM "stories"  ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "Politics"]]
SELECT "stories".* FROM "stories" WHERE "stories"."category_id" = ?  ORDER BY created_at DESC  [["category_id", 1]]

	def show
		 @reviews =  @story.reviews.order("created_at DESC")
    unless @stories.present?
     @avg_review = 0
    else
     @avg_review = @reviews.average(:rating).present? ? @reviews.average(:rating).round(2) : 0
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."story_id" = ?  ORDER BY created_at DESC  [["story_id", 12]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."story_id" = ?  [["story_id", 1]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."story_id" = ?  [["story_id", 2]]

	def new
		@story = current_user.stories.build
		@categories = Category.all.map{ |c| [c.name, c.id] }
---
SELECT "categories".* FROM "categories"

	def create
		@story = current_user.stories.build(story_params)
		@story.category_id = params[:category_id]

		if @story.save
---
INSERT INTO "stories" ("headline", "summary", "writer", "url", "story_img_file_name", "story_img_content_type", "story_img_file_size", "story_img_updated_at", "user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def edit
		@categories = Category.all.map{ |c| [c.name, c.id] }
---
SELECT "categories".* FROM "categories"

	def update
		@story.category_id = params[:category_id]
		if @story.update(story_params)
---
UPDATE "stories" SET "summary" = ?, "writer" = ?, "url" = ?, "story_img_file_name" = ?, "story_img_content_type" = ?, "story_img_file_size" = ?, "story_img_updated_at" = ?, "updated_at" = ? WHERE "stories"."id" = ?

	def destroy
		@story.destroy
---
DELETE FROM "stories" WHERE "stories"."id" = ?  [["id", 1]]

		def find_story
			@story = Story.find(params[:id])
---
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", 3]]